<!-- dflook/terraform-github-actions {"workspace":"dev","backend_type":"s3","label":"dev","backend":"0f86e13064bf12cc05831214b1b5e3b2535d1b4f7d18f430c77aeff2c103c485","plan_job_ref":"Job CICD for Splitrr Infra #47 at https://github.com/bibek65/Splitrr-Infrastructure/actions/runs/10676768663","plan_out_hash":"5c0fdb17fa0f5eea57d4f7ab2d47b8587933df35e418d41ec77c260ed1ec5d49","plan_hash":"fc92b16352d98b78dbbc919bbdde0ee34e9eb888b8a99b7e511fe66c47f6955c","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan for __dev__
<details>
<summary>Plan: 1 to add, 1 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs-ec2.aws_ecs_service.app will be updated in-place
!~  resource "aws_ecs_service" "app" {
        id                                 = "arn:aws:ecs:us-east-1:949263681218:service/EC2-ECS-CLUSTER/splitrr-dev-backend-ecs-ec2-service"
        name                               = "splitrr-dev-backend-ecs-ec2-service"
        tags                               = {
            "Name" = "splitrr-dev-backend-ecs-ec2-service"
        }
!~      task_definition                    = "arn:aws:ecs:us-east-1:949263681218:task-definition/splitrr-dev-backend-ecs-ec2-task-def:3" -> (known after apply)
#        (16 unchanged attributes hidden)

#        (6 unchanged blocks hidden)
    }

  # module.ecs-ec2.aws_ecs_task_definition.app must be replaced
-/+ resource "aws_ecs_task_definition" "app" {
!~      arn                      = "arn:aws:ecs:us-east-1:949263681218:task-definition/splitrr-dev-backend-ecs-ec2-task-def:3" -> (known after apply)
!~      arn_without_revision     = "arn:aws:ecs:us-east-1:949263681218:task-definition/splitrr-dev-backend-ecs-ec2-task-def" -> (known after apply)
!~      container_definitions    = jsonencode(
!~          [
!~              {
!~                  logConfiguration = {
!~                      options   = {
!~                          awslogs-region        = "ap-southeast-2" -> "us-east-1"
#                            (2 unchanged attributes hidden)
                        }
#                        (1 unchanged attribute hidden)
                    }
-                   mountPoints      = []
                    name             = "splitrr-dev-backend-ecs-ec2-container"
!~                  portMappings     = [
!~                      {
-                           protocol      = "tcp"
#                            (2 unchanged attributes hidden)
                        },
                    ]
-                   systemControls   = []
-                   volumesFrom      = []
#                    (4 unchanged attributes hidden)
                },
            ] # forces replacement
        )
!~      id                       = "************************************" -> (known after apply)
!~      revision                 = 3 -> (known after apply)
        tags                     = {
            "Name" = "splitrr-dev-backend-ecs-ec2-task-def"
        }
#        (12 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [CICD for Splitrr Infra #47](https://github.com/bibek65/Splitrr-Infrastructure/actions/runs/10676768663)